# Дополните приведенный код, используя списочный метод append(), чтобы список list1 имел вид:
#
# list1 = [10, 20, [300, 400, [5000, 6000, 7000], 500], 30, 40]


# list1 = [10, 20, [300, 400, [5000, 6000], 500], 30, 40]
# num = 7000
# list1[2][2].append(num)
#
# print(list1)


# Дополните приведенный код, используя списочный метод extend(), чтобы список list1 имел вид:
#
# list1 = ['a', 'b', ['c', ['d', 'e', ['f', 'g', 'h', 'i', 'j'], 'k'], 'l'], 'm', 'n']
# Подсписок для расширения  sub_list = ['h', 'i', 'j'].

# list1 = ['a', 'b', ['c', ['d', 'e', ['f', 'g'], 'k'], 'l'], 'm', 'n']
# sub_list = ['h', 'i', 'j']
# list1[2][1][2].extend(sub_list)
# print(list1)


# Дополните приведенный код, используя цикл for и встроенную функцию max(),
# чтобы он выводил один общий максимальный элемент среди всех элементов вложенных списков list1.

list1 = [[1, 7, 8], [9, 7, 102], [6, 106, 105], [100, 99, 98, 103], [1, 2, 3]]
maximum = -1

for li in list1:
        if max(li) > maximum:
            maximum = max(li)
print(maximum)
